In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("job_candidates.csv")
df

   Unnamed: 0    name         city  age  pyscore
0         101  Xavier  Mexico City   41     88.0
1         102     Ann      Toronto   28     79.0
2         103    Jana       Prague   33     81.0
3         104      Yi     Shanghai   34     80.0
4         105   Robin   Manchester   38     68.0
5         106    Amal        Cairo   31     61.0
6         107    Nori        Osaka   37     84.0

In [3]:
data = {
    "name": ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    "city": ['Mexico city', 'Toronto', 'Prague', 'Shanghai',                       'Manchester', 'Cairo', 'Osaka'],
    "age": [41, 28, 33, 34, 38, 31, 37],
    "py-score": [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84],
}

raw_lables = [101, 102, 103, 104, 105, 106, 107]

In [7]:
df = pd.DataFrame(data=data, index=raw_lables)
df

       name         city  age  py-score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0